import styles from "./privacyPolicy.module.css";

const TermsAndConditions = () => {
  return (
    <div className={styles.container}>
      <h1>개인정보 처리방침</h1>
      <p>
        본 서비스는 다음과 같은 개인정보를 수집하며, 수집된 정보는 다음의
        목적으로 사용됩니다.
      </p>

      <h3>1. 수집하는 개인정보 항목</h3>
      <p>이름, 학번, 학과, PIN 번호, 이메일</p>

      <h3>2. 개인정보의 수집 및 이용목적</h3>
      <p>
        본 서비스는 다음과 같은 목적으로 개인정보를 수집하고 이용합니다.
        <br />① 회원관리: 회원제 서비스 이용에 따른 본인확인, 개인 식별, 가입
        의사 확인
      </p>

      <h3>3. 개인정보의 보유 및 이용기간</h3>
      <p>
        개인정보는 수집 및 이용 목적이 달성된 후에는 지체 없이 파기됩니다. 단,
        다음의 경우에 한하여 두 달 동안 보유할 수 있습니다.
        <br />
        ① 서비스 개선 및 분석을 위해 두 달 동안 데이터가 보관될 수 있으며, 이
        기간이 지나면 즉시 삭제됩니다.
        <br />② 법령에 따른 보존 의무가 있는 경우, 해당 기간 동안 보존됩니다.
      </p>

      <h3>4. 개인정보의 파기절차 및 방법</h3>
      <p>
        회원 탈퇴 시 전자적 파일 형태로 삭제됩니다. 종이에 출력된 개인정보는
        분쇄기로 파기하거나 소각을 통해 파기합니다.
      </p>

      <h3>5. 개인정보의 제3자 제공</h3>
      <p>
        수집된 개인정보는 원칙적으로 제3자에게 제공되지 않으며, 아래의 경우에
        한해 제공됩니다.
        <br />① 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와
        방법에 따라 수사기관의 요구가 있는 경우
      </p>

      <h3>6. 채팅 기능과 관련된 개인정보</h3>
      <p>
        본 서비스의 채팅 기능을 이용하는 경우, 다음과 같은 개인정보가 수집될 수
        있습니다.
        <br />① 수집 채팅 참여자 식별 정보
        <br />③ 보유 기간: 채팅 기록은 2개월 동안 보관되며, 이후에는 지체 없이
        파기됩니다.
      </p>

      <h3>7. 이용자 및 법정대리인의 권리와 그 행사 방법</h3>
      <p>
        이용자 및 법정대리인은 언제든지 등록되어 있는 자신 또는 만 14세 미만
        아동의 개인정보를 조회하거나 수정할 수 있으며, 가입해지를 요청할 수도
        있습니다.
        <br />
        이를 위해 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면
        지체 없이 조치하겠습니다.
      </p>

      <h3>8. 개인정보 보호책임자</h3>
      <p>
        개인정보 보호책임자는 다음과 같습니다.
        <br />
        ① 이름: 변예섭
        <br />② 연락처: [skuwithbuddy@gmail.com]
      </p>

      <h3>9. 기타</h3>
      <p>
        본 개인정보처리방침은 법령 및 회사 방침에 따라 변경될 수 있으며, 변경
        시에는 변경사항을 공지사항을 통해 알립니다.
      </p>
    </div>
  );
};

export default TermsAndConditions;